tap "fluxcd/tap"
tap "googlecontainertools/kpt", "https://github.com/GoogleContainerTools/kpt.git"
tap "mongodb/brew"
tap "supabase/tap"
tap "withgraphite/tap"
brew "age"
brew "little-cms2"
brew "autoconf"
brew "automake"
brew "awscli"
brew "bash"
brew "bat"
brew "python@3.14"
brew "certbot"
brew "cmake"
brew "curl"
brew "direnv"
brew "node"
brew "gemini-cli"
brew "gh"
brew "git"
brew "libksba"
brew "gnupg"
brew "helm"
brew "jq"
brew "k3d"
brew "k9s"
brew "kind"
brew "kubectx"
brew "kustomize"
brew "libfido2"
brew "libheif"
brew "libimobiledevice"
brew "libpq"
brew "libraw"
brew "librsvg"
brew "libsodium"
brew "libtool"
brew "libzip"
brew "minikube"
brew "neo4j-mcp"
brew "neovim"
brew "pipx"
brew "ripgrep"
brew "sloc"
brew "sops"
brew "step"
brew "supabase"
brew "terragrunt"
brew "tfenv"
brew "uv"
brew "vim"
brew "wget"
brew "yamllint"
brew "fluxcd/tap/flux"
brew "googlecontainertools/kpt/kpt"
brew "withgraphite/tap/graphite"
cask "1password"
cask "1password-cli"
cask "backblaze"
cask "claude"
cask "curseforge"
cask "cursor"
cask "discord"
cask "docker-desktop"
cask "feed-the-beast"
cask "figma"
cask "font-fira-code-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "loom"
cask "microsoft-teams"
cask "minecraft"
cask "musescore"
cask "ngrok"
cask "notion"
cask "nvidia-geforce-now"
cask "obsidian"
cask "postman"
cask "raspberry-pi-imager"
cask "spotify"
cask "steam"
cask "tower"
cask "transmit"
cask "virtualbox"
cask "visual-studio-code"
vscode "4ops.terraform"
vscode "akamud.vscode-theme-onedark"
vscode "angular.ng-template"
vscode "anseki.vscode-color"
vscode "arcanis.vscode-zipfs"
vscode "bengreenier.vscode-node-readme"
vscode "bradlc.vscode-tailwindcss"
vscode "brapifra.phpserver"
vscode "chouzz.vscode-better-align"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cjhowe7.laravel-blade"
vscode "ckolkman.vscode-postgres"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "fisheva.eva-theme"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "heyimfuzz.banner-comments"
vscode "jakebathman.mysql-syntax"
vscode "jolaleye.horizon-theme-vscode"
vscode "kd3n1z.vscode-material-theme-icons"
vscode "knisterpeter.vscode-commitizen"
vscode "liviuschera.noctis"
vscode "mariomatheu.syntax-project-pbxproj"
vscode "mikestead.dotenv"
vscode "mjmcloug.vscode-elixir"
vscode "mohsen1.prettify-json"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-mssql.data-workspace-vscode"
vscode "ms-mssql.mssql"
vscode "ms-mssql.sql-bindings-vscode"
vscode "ms-mssql.sql-database-projects-vscode"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "naumovs.color-highlight"
vscode "netcorext.uuid-generator"
vscode "nextfaze.json-parse-stringify"
vscode "pflannery.vscode-versionlens"
vscode "piousdeer.horizon-theme-vscode-default-token-colors"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "rexshi.phpdoc-comment-vscode-plugin"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-lsp"
vscode "stackbreak.comment-divider"
vscode "statelyai.stately-vscode"
vscode "steoates.autoimport"
vscode "syler.sass-indented"
vscode "t3dotgg.vsc-material-theme-but-i-wont-sue-you"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "toba.vsfire"
vscode "tusaeff.vscode-iterm2-theme-sync"
vscode "tyriar.lorem-ipsum"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wupb.arrange-selection"
vscode "yummygum.city-lights-theme"
vscode "zhouronghui.propertylist"
vscode "zignd.html-css-class-completion"
vscode "zxh404.vscode-proto3"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
uv "specify-cli"
